
# ------------------------------------ Short text -------------------------------------------

CANCEL = "Завершить ❌"
DOWNLOAD_EXEL = "Загрузка файла 📀"
FIND_VALUES = "🔍 Нахождение элемента"
CANCEL_WRITING_DATA = "️❗️Запись данных завершена❗"

SEND_EXEL_FILE = "📀 Отправьте или перешлите Exel файл:"
WAITING_DOWNLOAD = "⏳ Ожидайте, файл загружается..."
ENTRY_EXCHANGE_DOLLAR = "💸 Введите курс доллара:"
DATA_DOWNLOADED = "📥 Данные записаны, начинайте работу 🗂"
ENTRY_SELECTED_PRODUCT = "🔎 ️Введите название товара:"

NOT_SELECTED_FILE_EXCEL = "⚠ Вы не выбрали файл, загрузите его ⚠"
IS_NOT_EXEL_FILE = "⚠Это не Exel файл⚠"

ERROR_MESSAGE_EMPTY = "⚠Похожие элементы не найдены⚠"
ERROR_FLOOD = "⚠ Превышен лимит отправки сообщений, попробуйте снова через 5 минут ⚠"
ERROR_OPENED_FILE = "⚠ Excel-файл открыт, закройте его ⚠"
ERROR_ANOTHER = "⚠ Что-то пошло не так ⚠\n\nНазвание ошибки: "


# -------------------------------------- Long text ----------------------------------------------

START_DESCRIPTION = "<i>Этот бот облегчит вам работу с таблицами в Exel, например в таких категориях как: </i>" \
                    "<i>загрузка готового Exel файл в бот и начало работы с этим же файлом; нахождение </i>" \
                    "<i>нужного продукта во всей Exel таблице.</i>\n\n<b>🔻 /find_product - эта функция поможет </b>" \
                    "<b>выдать все значения из колонок выбрав похожие элемент и выведет их на экран.</b>" \
                    "<b>\n🔻 /download_exel - эта команда запрашивает ваш имеющийся Exel файл, после отправки </b>" \
                    "<b>файла вы уже сможете работать с ним.\n\nНу что? Начнём работу!? 😄</b>"
